/**
Создать торговый кофейный автомат, напитки в автомате должны содержать следующие данные: наименование, объем, температура, цена. 
Проинициализировать несколько напитков в классе main и торговый автомат, воспроизвести логику продажи напитков. Сделать на основе ООП
 */
public class Main {

    public static void main(String[] args) {
        System.out.print("\033[H\033[J");
        System.out.println("Initialization");
    }
}